In [1]:
#1. 여성분들이 가장 많이 종사하고 있는 직종이 무엇인지 파악해 보세요.

In [2]:
import pandas as pd
import seaborn as sns

In [6]:
df = pd.read_csv('occupations.csv')
df

   user_id  age gender  occupation zip_code
0        1   24      M  technician    85711
1        2   53      F       other    94043
2        3   23      M      writer    32067
3        4   24      M  technician    43537
4        5   33      F       other    15213

In [13]:
womden = df[df['gender']=='F']

In [18]:
womden['occupation'].value_counts().sort_values(ascending=False)

student          60
other            36
administrator    36
librarian        29
educator         26
writer           19
artist           13
healthcare       11
marketing        10
programmer        6
homemaker         6
none              4
salesman          3
scientist         3
executive         3
lawyer            2
engineer          2
entertainment     2
retired           1
technician        1
Name: occupation, dtype: int64

In [23]:
#1. 여성분들이 가장 많이 종사하고 있는 직종이 무엇인지 파악해 보세요.
men = df[df['gender']=='M']
men

     user_id  age gender     occupation zip_code
0          1   24      M     technician    85711
2          3   23      M         writer    32067
3          4   24      M     technician    43537
5          6   42      M      executive    98101
6          7   57      M  administrator    91344
..       ...  ...    ...            ...      ...
935      936   24      M          other    32789
936      937   48      M       educator    98072
939      940   32      M  administrator    02215
940      941   20      M        student    97229
942      943   22      M        student    77841

[670 rows x 5 columns]

In [25]:
men['occupation'].value_counts().sort_values(ascending=False)

student          136
educator          69
other             69
engineer          65
programmer        60
administrator     43
executive         29
scientist         28
writer            26
technician        26
librarian         22
marketing         16
entertainment     16
artist            15
retired           13
lawyer            10
salesman           9
doctor             7
healthcare         5
none               5
homemaker          1
Name: occupation, dtype: int64